7767517
3195 4078
Input                    input                    0 1 input
Split                    splitncnn_input0         1 2 input input_splitncnn_0 input_splitncnn_1
MemoryData               /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0 0 1 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0 0=1
Split                    splitncnn_0              1 264 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_2 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_3 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_4 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_5 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_6 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_7 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_8 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_9 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_10 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_11 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_12 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_13 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_14 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_15 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_16 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_17 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_18 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_19 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_20 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_21 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_22 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_23 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_24 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_25 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_26 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_27 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_28 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_29 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_30 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_31 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_32 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_33 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_34 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_35 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_36 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_37 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_38 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_39 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_40 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_41 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_42 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_43 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_44 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_45 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_46 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_47 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_48 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_49 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_50 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_51 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_52 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_53 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_54 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_55 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_56 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_57 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_58 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_59 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_60 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_61 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_62 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_63 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_64 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_65 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_66 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_67 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_68 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_69 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_70 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_71 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_72 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_73 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_74 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_75 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_76 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_77 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_78 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_79 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_80 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_81 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_82 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_83 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_84 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_85 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_86 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_87 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_88 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_89 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_90 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_91 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_92 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_93 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_94 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_95 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_96 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_97 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_98 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_99 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_100 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_101 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_102 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_103 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_104 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_105 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_106 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_107 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_108 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_109 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_110 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_111 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_112 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_113 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_114 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_115 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_116 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_117 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_118 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_119 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_120 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_121 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_122 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_123 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_124 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_125 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_126 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_127 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_128 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_129 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_130 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_131 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_132 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_133 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_134 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_135 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_136 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_137 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_138 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_139 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_140 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_141 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_142 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_143 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_144 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_145 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_146 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_147 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_148 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_149 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_150 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_151 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_152 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_153 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_154 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_155 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_156 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_157 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_158 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_159 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_160 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_161 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_162 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_163 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_164 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_165 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_166 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_167 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_168 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_169 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_170 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_171 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_172 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_173 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_174 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_175 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_176 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_177 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_178 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_179 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_180 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_181 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_182 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_183 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_184 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_185 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_186 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_187 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_188 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_189 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_190 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_191 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_192 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_193 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_194 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_195 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_196 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_197 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_198 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_199 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_200 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_201 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_202 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_203 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_204 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_205 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_206 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_207 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_208 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_209 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_210 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_211 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_212 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_213 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_214 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_215 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_216 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_217 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_218 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_219 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_220 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_221 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_222 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_223 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_224 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_225 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_226 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_227 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_228 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_229 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_230 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_231 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_232 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_233 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_234 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_235 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_236 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_237 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_238 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_239 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_240 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_241 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_242 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_243 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_244 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_245 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_246 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_247 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_248 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_249 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_250 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_251 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_252 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_253 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_254 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_255 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_256 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_257 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_258 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_259 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_260 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_261 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_262 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_263
MemoryData               decoder_level1.0.attn.temperature 0 1 decoder_level1.0.attn.temperature 0=1 1=1
MemoryData               decoder_level1.0.norm1.body.weight 0 1 decoder_level1.0.norm1.body.weight 0=96
MemoryData               decoder_level1.0.norm2.body.weight 0 1 decoder_level1.0.norm2.body.weight 0=96
MemoryData               decoder_level1.1.attn.temperature 0 1 decoder_level1.1.attn.temperature 0=1 1=1
MemoryData               decoder_level1.1.norm1.body.weight 0 1 decoder_level1.1.norm1.body.weight 0=96
MemoryData               decoder_level1.1.norm2.body.weight 0 1 decoder_level1.1.norm2.body.weight 0=96
MemoryData               decoder_level1.2.attn.temperature 0 1 decoder_level1.2.attn.temperature 0=1 1=1
MemoryData               decoder_level1.2.norm1.body.weight 0 1 decoder_level1.2.norm1.body.weight 0=96
MemoryData               decoder_level1.2.norm2.body.weight 0 1 decoder_level1.2.norm2.body.weight 0=96
MemoryData               decoder_level1.3.attn.temperature 0 1 decoder_level1.3.attn.temperature 0=1 1=1
MemoryData               decoder_level1.3.norm1.body.weight 0 1 decoder_level1.3.norm1.body.weight 0=96
MemoryData               decoder_level1.3.norm2.body.weight 0 1 decoder_level1.3.norm2.body.weight 0=96
MemoryData               decoder_level2.0.attn.temperature 0 1 decoder_level2.0.attn.temperature 0=1 1=1 2=2
MemoryData               decoder_level2.0.norm1.body.weight 0 1 decoder_level2.0.norm1.body.weight 0=96
MemoryData               decoder_level2.0.norm2.body.weight 0 1 decoder_level2.0.norm2.body.weight 0=96
MemoryData               decoder_level2.1.attn.temperature 0 1 decoder_level2.1.attn.temperature 0=1 1=1 2=2
MemoryData               decoder_level2.1.norm1.body.weight 0 1 decoder_level2.1.norm1.body.weight 0=96
MemoryData               decoder_level2.1.norm2.body.weight 0 1 decoder_level2.1.norm2.body.weight 0=96
MemoryData               decoder_level2.2.attn.temperature 0 1 decoder_level2.2.attn.temperature 0=1 1=1 2=2
MemoryData               decoder_level2.2.norm1.body.weight 0 1 decoder_level2.2.norm1.body.weight 0=96
MemoryData               decoder_level2.2.norm2.body.weight 0 1 decoder_level2.2.norm2.body.weight 0=96
MemoryData               decoder_level2.3.attn.temperature 0 1 decoder_level2.3.attn.temperature 0=1 1=1 2=2
MemoryData               decoder_level2.3.norm1.body.weight 0 1 decoder_level2.3.norm1.body.weight 0=96
MemoryData               decoder_level2.3.norm2.body.weight 0 1 decoder_level2.3.norm2.body.weight 0=96
MemoryData               decoder_level2.4.attn.temperature 0 1 decoder_level2.4.attn.temperature 0=1 1=1 2=2
MemoryData               decoder_level2.4.norm1.body.weight 0 1 decoder_level2.4.norm1.body.weight 0=96
MemoryData               decoder_level2.4.norm2.body.weight 0 1 decoder_level2.4.norm2.body.weight 0=96
MemoryData               decoder_level2.5.attn.temperature 0 1 decoder_level2.5.attn.temperature 0=1 1=1 2=2
MemoryData               decoder_level2.5.norm1.body.weight 0 1 decoder_level2.5.norm1.body.weight 0=96
MemoryData               decoder_level2.5.norm2.body.weight 0 1 decoder_level2.5.norm2.body.weight 0=96
MemoryData               decoder_level3.0.attn.temperature 0 1 decoder_level3.0.attn.temperature 0=1 1=1 2=4
MemoryData               decoder_level3.0.norm1.body.weight 0 1 decoder_level3.0.norm1.body.weight 0=192
MemoryData               decoder_level3.0.norm2.body.weight 0 1 decoder_level3.0.norm2.body.weight 0=192
MemoryData               decoder_level3.1.attn.temperature 0 1 decoder_level3.1.attn.temperature 0=1 1=1 2=4
MemoryData               decoder_level3.1.norm1.body.weight 0 1 decoder_level3.1.norm1.body.weight 0=192
MemoryData               decoder_level3.1.norm2.body.weight 0 1 decoder_level3.1.norm2.body.weight 0=192
MemoryData               decoder_level3.2.attn.temperature 0 1 decoder_level3.2.attn.temperature 0=1 1=1 2=4
MemoryData               decoder_level3.2.norm1.body.weight 0 1 decoder_level3.2.norm1.body.weight 0=192
MemoryData               decoder_level3.2.norm2.body.weight 0 1 decoder_level3.2.norm2.body.weight 0=192
MemoryData               decoder_level3.3.attn.temperature 0 1 decoder_level3.3.attn.temperature 0=1 1=1 2=4
MemoryData               decoder_level3.3.norm1.body.weight 0 1 decoder_level3.3.norm1.body.weight 0=192
MemoryData               decoder_level3.3.norm2.body.weight 0 1 decoder_level3.3.norm2.body.weight 0=192
MemoryData               decoder_level3.4.attn.temperature 0 1 decoder_level3.4.attn.temperature 0=1 1=1 2=4
MemoryData               decoder_level3.4.norm1.body.weight 0 1 decoder_level3.4.norm1.body.weight 0=192
MemoryData               decoder_level3.4.norm2.body.weight 0 1 decoder_level3.4.norm2.body.weight 0=192
MemoryData               decoder_level3.5.attn.temperature 0 1 decoder_level3.5.attn.temperature 0=1 1=1 2=4
MemoryData               decoder_level3.5.norm1.body.weight 0 1 decoder_level3.5.norm1.body.weight 0=192
MemoryData               decoder_level3.5.norm2.body.weight 0 1 decoder_level3.5.norm2.body.weight 0=192
MemoryData               encoder_level1.0.attn.temperature 0 1 encoder_level1.0.attn.temperature 0=1 1=1
MemoryData               encoder_level1.0.norm1.body.weight 0 1 encoder_level1.0.norm1.body.weight 0=48
MemoryData               encoder_level1.0.norm2.body.weight 0 1 encoder_level1.0.norm2.body.weight 0=48
MemoryData               encoder_level1.1.attn.temperature 0 1 encoder_level1.1.attn.temperature 0=1 1=1
MemoryData               encoder_level1.1.norm1.body.weight 0 1 encoder_level1.1.norm1.body.weight 0=48
MemoryData               encoder_level1.1.norm2.body.weight 0 1 encoder_level1.1.norm2.body.weight 0=48
MemoryData               encoder_level1.2.attn.temperature 0 1 encoder_level1.2.attn.temperature 0=1 1=1
MemoryData               encoder_level1.2.norm1.body.weight 0 1 encoder_level1.2.norm1.body.weight 0=48
MemoryData               encoder_level1.2.norm2.body.weight 0 1 encoder_level1.2.norm2.body.weight 0=48
MemoryData               encoder_level1.3.attn.temperature 0 1 encoder_level1.3.attn.temperature 0=1 1=1
MemoryData               encoder_level1.3.norm1.body.weight 0 1 encoder_level1.3.norm1.body.weight 0=48
MemoryData               encoder_level1.3.norm2.body.weight 0 1 encoder_level1.3.norm2.body.weight 0=48
MemoryData               encoder_level2.0.attn.temperature 0 1 encoder_level2.0.attn.temperature 0=1 1=1 2=2
MemoryData               encoder_level2.0.norm1.body.weight 0 1 encoder_level2.0.norm1.body.weight 0=96
MemoryData               encoder_level2.0.norm2.body.weight 0 1 encoder_level2.0.norm2.body.weight 0=96
MemoryData               encoder_level2.1.attn.temperature 0 1 encoder_level2.1.attn.temperature 0=1 1=1 2=2
MemoryData               encoder_level2.1.norm1.body.weight 0 1 encoder_level2.1.norm1.body.weight 0=96
MemoryData               encoder_level2.1.norm2.body.weight 0 1 encoder_level2.1.norm2.body.weight 0=96
MemoryData               encoder_level2.2.attn.temperature 0 1 encoder_level2.2.attn.temperature 0=1 1=1 2=2
MemoryData               encoder_level2.2.norm1.body.weight 0 1 encoder_level2.2.norm1.body.weight 0=96
MemoryData               encoder_level2.2.norm2.body.weight 0 1 encoder_level2.2.norm2.body.weight 0=96
MemoryData               encoder_level2.3.attn.temperature 0 1 encoder_level2.3.attn.temperature 0=1 1=1 2=2
MemoryData               encoder_level2.3.norm1.body.weight 0 1 encoder_level2.3.norm1.body.weight 0=96
MemoryData               encoder_level2.3.norm2.body.weight 0 1 encoder_level2.3.norm2.body.weight 0=96
MemoryData               encoder_level2.4.attn.temperature 0 1 encoder_level2.4.attn.temperature 0=1 1=1 2=2
MemoryData               encoder_level2.4.norm1.body.weight 0 1 encoder_level2.4.norm1.body.weight 0=96
MemoryData               encoder_level2.4.norm2.body.weight 0 1 encoder_level2.4.norm2.body.weight 0=96
MemoryData               encoder_level2.5.attn.temperature 0 1 encoder_level2.5.attn.temperature 0=1 1=1 2=2
MemoryData               encoder_level2.5.norm1.body.weight 0 1 encoder_level2.5.norm1.body.weight 0=96
MemoryData               encoder_level2.5.norm2.body.weight 0 1 encoder_level2.5.norm2.body.weight 0=96
MemoryData               encoder_level3.0.attn.temperature 0 1 encoder_level3.0.attn.temperature 0=1 1=1 2=4
MemoryData               encoder_level3.0.norm1.body.weight 0 1 encoder_level3.0.norm1.body.weight 0=192
MemoryData               encoder_level3.0.norm2.body.weight 0 1 encoder_level3.0.norm2.body.weight 0=192
MemoryData               encoder_level3.1.attn.temperature 0 1 encoder_level3.1.attn.temperature 0=1 1=1 2=4
MemoryData               encoder_level3.1.norm1.body.weight 0 1 encoder_level3.1.norm1.body.weight 0=192
MemoryData               encoder_level3.1.norm2.body.weight 0 1 encoder_level3.1.norm2.body.weight 0=192
MemoryData               encoder_level3.2.attn.temperature 0 1 encoder_level3.2.attn.temperature 0=1 1=1 2=4
MemoryData               encoder_level3.2.norm1.body.weight 0 1 encoder_level3.2.norm1.body.weight 0=192
MemoryData               encoder_level3.2.norm2.body.weight 0 1 encoder_level3.2.norm2.body.weight 0=192
MemoryData               encoder_level3.3.attn.temperature 0 1 encoder_level3.3.attn.temperature 0=1 1=1 2=4
MemoryData               encoder_level3.3.norm1.body.weight 0 1 encoder_level3.3.norm1.body.weight 0=192
MemoryData               encoder_level3.3.norm2.body.weight 0 1 encoder_level3.3.norm2.body.weight 0=192
MemoryData               encoder_level3.4.attn.temperature 0 1 encoder_level3.4.attn.temperature 0=1 1=1 2=4
MemoryData               encoder_level3.4.norm1.body.weight 0 1 encoder_level3.4.norm1.body.weight 0=192
MemoryData               encoder_level3.4.norm2.body.weight 0 1 encoder_level3.4.norm2.body.weight 0=192
MemoryData               encoder_level3.5.attn.temperature 0 1 encoder_level3.5.attn.temperature 0=1 1=1 2=4
MemoryData               encoder_level3.5.norm1.body.weight 0 1 encoder_level3.5.norm1.body.weight 0=192
MemoryData               encoder_level3.5.norm2.body.weight 0 1 encoder_level3.5.norm2.body.weight 0=192
MemoryData               latent.0.attn.temperature 0 1 latent.0.attn.temperature 0=1 1=1 2=8
MemoryData               latent.0.norm1.body.weight 0 1 latent.0.norm1.body.weight 0=384
MemoryData               latent.0.norm2.body.weight 0 1 latent.0.norm2.body.weight 0=384
MemoryData               latent.1.attn.temperature 0 1 latent.1.attn.temperature 0=1 1=1 2=8
MemoryData               latent.1.norm1.body.weight 0 1 latent.1.norm1.body.weight 0=384
MemoryData               latent.1.norm2.body.weight 0 1 latent.1.norm2.body.weight 0=384
MemoryData               latent.2.attn.temperature 0 1 latent.2.attn.temperature 0=1 1=1 2=8
MemoryData               latent.2.norm1.body.weight 0 1 latent.2.norm1.body.weight 0=384
MemoryData               latent.2.norm2.body.weight 0 1 latent.2.norm2.body.weight 0=384
MemoryData               latent.3.attn.temperature 0 1 latent.3.attn.temperature 0=1 1=1 2=8
MemoryData               latent.3.norm1.body.weight 0 1 latent.3.norm1.body.weight 0=384
MemoryData               latent.3.norm2.body.weight 0 1 latent.3.norm2.body.weight 0=384
MemoryData               latent.4.attn.temperature 0 1 latent.4.attn.temperature 0=1 1=1 2=8
MemoryData               latent.4.norm1.body.weight 0 1 latent.4.norm1.body.weight 0=384
MemoryData               latent.4.norm2.body.weight 0 1 latent.4.norm2.body.weight 0=384
MemoryData               latent.5.attn.temperature 0 1 latent.5.attn.temperature 0=1 1=1 2=8
MemoryData               latent.5.norm1.body.weight 0 1 latent.5.norm1.body.weight 0=384
MemoryData               latent.5.norm2.body.weight 0 1 latent.5.norm2.body.weight 0=384
MemoryData               latent.6.attn.temperature 0 1 latent.6.attn.temperature 0=1 1=1 2=8
MemoryData               latent.6.norm1.body.weight 0 1 latent.6.norm1.body.weight 0=384
MemoryData               latent.6.norm2.body.weight 0 1 latent.6.norm2.body.weight 0=384
MemoryData               latent.7.attn.temperature 0 1 latent.7.attn.temperature 0=1 1=1 2=8
MemoryData               latent.7.norm1.body.weight 0 1 latent.7.norm1.body.weight 0=384
MemoryData               latent.7.norm2.body.weight 0 1 latent.7.norm2.body.weight 0=384
MemoryData               refinement.0.attn.temperature 0 1 refinement.0.attn.temperature 0=1 1=1
MemoryData               refinement.0.norm1.body.weight 0 1 refinement.0.norm1.body.weight 0=96
MemoryData               refinement.0.norm2.body.weight 0 1 refinement.0.norm2.body.weight 0=96
MemoryData               refinement.1.attn.temperature 0 1 refinement.1.attn.temperature 0=1 1=1
MemoryData               refinement.1.norm1.body.weight 0 1 refinement.1.norm1.body.weight 0=96
MemoryData               refinement.1.norm2.body.weight 0 1 refinement.1.norm2.body.weight 0=96
MemoryData               refinement.2.attn.temperature 0 1 refinement.2.attn.temperature 0=1 1=1
MemoryData               refinement.2.norm1.body.weight 0 1 refinement.2.norm1.body.weight 0=96
MemoryData               refinement.2.norm2.body.weight 0 1 refinement.2.norm2.body.weight 0=96
MemoryData               refinement.3.attn.temperature 0 1 refinement.3.attn.temperature 0=1 1=1
MemoryData               refinement.3.norm1.body.weight 0 1 refinement.3.norm1.body.weight 0=96
MemoryData               refinement.3.norm2.body.weight 0 1 refinement.3.norm2.body.weight 0=96
Convolution              /patch_embed/proj/Conv   1 1 input_splitncnn_1 /patch_embed/proj/Conv_output_0 0=48 1=3 4=1 6=1296
Split                    splitncnn_1              1 2 /patch_embed/proj/Conv_output_0 /patch_embed/proj/Conv_output_0_splitncnn_0 /patch_embed/proj/Conv_output_0_splitncnn_1
Permute                  /encoder_level1/encoder_level1.0/norm1/Transpose 1 1 /patch_embed/proj/Conv_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/Transpose_output_0 0=3
Reshape                  /encoder_level1/encoder_level1.0/norm1/Reshape 1 1 /encoder_level1/encoder_level1.0/norm1/Transpose_output_0 /encoder_level1/encoder_level1.0/norm1/Reshape_output_0 0=48 1=262144
Split                    splitncnn_2              1 2 /encoder_level1/encoder_level1.0/norm1/Reshape_output_0 /encoder_level1/encoder_level1.0/norm1/Reshape_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm1/Reshape_output_0_splitncnn_1
Reduction                /encoder_level1/encoder_level1.0/norm1/body/ReduceMean 2 1 /encoder_level1/encoder_level1.0/norm1/Reshape_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_263 /encoder_level1/encoder_level1.0/norm1/body/ReduceMean_output_0 0=3 4=1
BinaryOp                 /encoder_level1/encoder_level1.0/norm1/body/Sub 2 1 /encoder_level1/encoder_level1.0/norm1/Reshape_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm1/body/ReduceMean_output_0 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0 0=1
Split                    splitncnn_3              1 3 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0_splitncnn_2
BinaryOp                 /encoder_level1/encoder_level1.0/norm1/body/Mul 2 1 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0_splitncnn_2 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/body/Mul_output_0 0=2
Reduction                /encoder_level1/encoder_level1.0/norm1/body/ReduceMean_2 2 1 /encoder_level1/encoder_level1.0/norm1/body/Mul_output_0 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_262 /encoder_level1/encoder_level1.0/norm1/body/ReduceMean_2_output_0 0=3 4=1
BinaryOp                 /encoder_level1/encoder_level1.0/norm1/body/Add 1 1 /encoder_level1/encoder_level1.0/norm1/body/ReduceMean_2_output_0 /encoder_level1/encoder_level1.0/norm1/body/Add_output_0 1=1 2=1.000000e-05
UnaryOp                  /encoder_level1/encoder_level1.0/norm1/body/Sqrt 1 1 /encoder_level1/encoder_level1.0/norm1/body/Add_output_0 /encoder_level1/encoder_level1.0/norm1/body/Sqrt_output_0 0=5
BinaryOp                 /encoder_level1/encoder_level1.0/norm1/body/Div 2 1 /encoder_level1/encoder_level1.0/norm1/body/Sub_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm1/body/Sqrt_output_0 /encoder_level1/encoder_level1.0/norm1/body/Div_output_0 0=3
BinaryOp                 /encoder_level1/encoder_level1.0/norm1/body/Mul_1 2 1 /encoder_level1/encoder_level1.0/norm1/body/Div_output_0 encoder_level1.0.norm1.body.weight /encoder_level1/encoder_level1.0/norm1/body/Mul_1_output_0 0=2
Reshape                  /encoder_level1/encoder_level1.0/norm1/Reshape_1 1 1 /encoder_level1/encoder_level1.0/norm1/body/Mul_1_output_0 /encoder_level1/encoder_level1.0/norm1/Reshape_1_output_0 0=48 1=512 2=512
Permute                  /encoder_level1/encoder_level1.0/norm1/Transpose_1 1 1 /encoder_level1/encoder_level1.0/norm1/Reshape_1_output_0 /encoder_level1/encoder_level1.0/norm1/Transpose_1_output_0 0=4
Convolution              /encoder_level1/encoder_level1.0/attn/qkv/Conv 1 1 /encoder_level1/encoder_level1.0/norm1/Transpose_1_output_0 /encoder_level1/encoder_level1.0/attn/qkv/Conv_output_0 0=144 1=1 5=1 6=6912
ConvolutionDepthWise     /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv 1 1 /encoder_level1/encoder_level1.0/attn/qkv/Conv_output_0 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0 0=144 1=3 4=1 5=1 6=1296 7=144
Split                    splitncnn_4              1 3 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0_splitncnn_2
Crop                     /encoder_level1/encoder_level1.0/attn/Slice 1 1 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0_splitncnn_2 /encoder_level1/encoder_level1.0/attn/Slice_output_0 -23309=1,0 -23310=1,48 -23311=1,0
Crop                     /encoder_level1/encoder_level1.0/attn/Slice_1 1 1 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/attn/Slice_1_output_0 -23309=1,48 -23310=1,96 -23311=1,0
Crop                     /encoder_level1/encoder_level1.0/attn/Slice_2 1 1 /encoder_level1/encoder_level1.0/attn/qkv_dwconv/Conv_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/attn/Slice_2_output_0 -23309=1,96 -23310=1,144 -23311=1,0
Reshape                  /encoder_level1/encoder_level1.0/attn/Reshape_1 1 1 /encoder_level1/encoder_level1.0/attn/Slice_output_0 /encoder_level1/encoder_level1.0/attn/Reshape_1_output_0 0=262144 1=48 2=1
Split                    splitncnn_5              1 2 /encoder_level1/encoder_level1.0/attn/Reshape_1_output_0 /encoder_level1/encoder_level1.0/attn/Reshape_1_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/attn/Reshape_1_output_0_splitncnn_1
Reshape                  /encoder_level1/encoder_level1.0/attn/Reshape_3 1 1 /encoder_level1/encoder_level1.0/attn/Slice_1_output_0 /encoder_level1/encoder_level1.0/attn/Reshape_3_output_0 0=262144 1=48 2=1
Split                    splitncnn_6              1 2 /encoder_level1/encoder_level1.0/attn/Reshape_3_output_0 /encoder_level1/encoder_level1.0/attn/Reshape_3_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/attn/Reshape_3_output_0_splitncnn_1
Reshape                  /encoder_level1/encoder_level1.0/attn/Reshape_5 1 1 /encoder_level1/encoder_level1.0/attn/Slice_2_output_0 /encoder_level1/encoder_level1.0/attn/Reshape_5_output_0 0=262144 1=48 2=1
Reduction                /encoder_level1/encoder_level1.0/attn/ReduceL2 2 1 /encoder_level1/encoder_level1.0/attn/Reshape_1_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_261 /encoder_level1/encoder_level1.0/attn/ReduceL2_output_0 0=8 4=1
Clip                     /encoder_level1/encoder_level1.0/attn/Clip 1 1 /encoder_level1/encoder_level1.0/attn/ReduceL2_output_0 /encoder_level1/encoder_level1.0/attn/Clip_output_0 0=1.000000e-12 1=3.402823e+38
BinaryOp                 /encoder_level1/encoder_level1.0/attn/Div_1 2 1 /encoder_level1/encoder_level1.0/attn/Reshape_1_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/attn/Clip_output_0 /encoder_level1/encoder_level1.0/attn/Div_1_output_0 0=3
Reduction                /encoder_level1/encoder_level1.0/attn/ReduceL2_1 2 1 /encoder_level1/encoder_level1.0/attn/Reshape_3_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_260 /encoder_level1/encoder_level1.0/attn/ReduceL2_1_output_0 0=8 4=1
Clip                     /encoder_level1/encoder_level1.0/attn/Clip_1 1 1 /encoder_level1/encoder_level1.0/attn/ReduceL2_1_output_0 /encoder_level1/encoder_level1.0/attn/Clip_1_output_0 0=1.000000e-12 1=3.402823e+38
BinaryOp                 /encoder_level1/encoder_level1.0/attn/Div_2 2 1 /encoder_level1/encoder_level1.0/attn/Reshape_3_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/attn/Clip_1_output_0 /encoder_level1/encoder_level1.0/attn/Div_2_output_0 0=3
Permute                  /encoder_level1/encoder_level1.0/attn/Transpose 1 1 /encoder_level1/encoder_level1.0/attn/Div_2_output_0 /encoder_level1/encoder_level1.0/attn/Transpose_output_0 0=1
Gemm                     /encoder_level1/encoder_level1.0/attn/MatMul 2 1 /encoder_level1/encoder_level1.0/attn/Div_1_output_0 /encoder_level1/encoder_level1.0/attn/Transpose_output_0 /encoder_level1/encoder_level1.0/attn/MatMul_output_0
BinaryOp                 /encoder_level1/encoder_level1.0/attn/Mul_3 2 1 /encoder_level1/encoder_level1.0/attn/MatMul_output_0 encoder_level1.0.attn.temperature /encoder_level1/encoder_level1.0/attn/Mul_3_output_0 0=2
Softmax                  /encoder_level1/encoder_level1.0/attn/Softmax 1 1 /encoder_level1/encoder_level1.0/attn/Mul_3_output_0 /encoder_level1/encoder_level1.0/attn/Softmax_output_0 0=-2 1=1
Gemm                     /encoder_level1/encoder_level1.0/attn/MatMul_1 2 1 /encoder_level1/encoder_level1.0/attn/Softmax_output_0 /encoder_level1/encoder_level1.0/attn/Reshape_5_output_0 /encoder_level1/encoder_level1.0/attn/MatMul_1_output_0
Reshape                  /encoder_level1/encoder_level1.0/attn/Reshape_7 1 1 /encoder_level1/encoder_level1.0/attn/MatMul_1_output_0 /encoder_level1/encoder_level1.0/attn/Reshape_7_output_0 0=512 1=512 2=48
Convolution              /encoder_level1/encoder_level1.0/attn/project_out/Conv 1 1 /encoder_level1/encoder_level1.0/attn/Reshape_7_output_0 /encoder_level1/encoder_level1.0/attn/project_out/Conv_output_0 0=48 1=1 5=1 6=2304
BinaryOp                 /encoder_level1/encoder_level1.0/Add 2 1 /patch_embed/proj/Conv_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/attn/project_out/Conv_output_0 /encoder_level1/encoder_level1.0/Add_output_0
Split                    splitncnn_7              1 2 /encoder_level1/encoder_level1.0/Add_output_0 /encoder_level1/encoder_level1.0/Add_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/Add_output_0_splitncnn_1
Permute                  /encoder_level1/encoder_level1.0/norm2/Transpose 1 1 /encoder_level1/encoder_level1.0/Add_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm2/Transpose_output_0 0=3
Reshape                  /encoder_level1/encoder_level1.0/norm2/Reshape 1 1 /encoder_level1/encoder_level1.0/norm2/Transpose_output_0 /encoder_level1/encoder_level1.0/norm2/Reshape_output_0 0=48 1=262144
Split                    splitncnn_8              1 2 /encoder_level1/encoder_level1.0/norm2/Reshape_output_0 /encoder_level1/encoder_level1.0/norm2/Reshape_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm2/Reshape_output_0_splitncnn_1
Reduction                /encoder_level1/encoder_level1.0/norm2/body/ReduceMean 2 1 /encoder_level1/encoder_level1.0/norm2/Reshape_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_259 /encoder_level1/encoder_level1.0/norm2/body/ReduceMean_output_0 0=3 4=1
BinaryOp                 /encoder_level1/encoder_level1.0/norm2/body/Sub 2 1 /encoder_level1/encoder_level1.0/norm2/Reshape_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm2/body/ReduceMean_output_0 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0 0=1
Split                    splitncnn_9              1 3 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0_splitncnn_2
BinaryOp                 /encoder_level1/encoder_level1.0/norm2/body/Mul 2 1 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0_splitncnn_2 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/norm2/body/Mul_output_0 0=2
Reduction                /encoder_level1/encoder_level1.0/norm2/body/ReduceMean_2 2 1 /encoder_level1/encoder_level1.0/norm2/body/Mul_output_0 /encoder_level1/encoder_level1.0/norm1/body/Constant_output_0_splitncnn_258 /encoder_level1/encoder_level1.0/norm2/body/ReduceMean_2_output_0 0=3 4=1
BinaryOp                 /encoder_level1/encoder_level1.0/norm2/body/Add 1 1 /encoder_level1/encoder_level1.0/norm2/body/ReduceMean_2_output_0 /encoder_level1/encoder_level1.0/norm2/body/Add_output_0 1=1 2=1.000000e-05
UnaryOp                  /encoder_level1/encoder_level1.0/norm2/body/Sqrt 1 1 /encoder_level1/encoder_level1.0/norm2/body/Add_output_0 /encoder_level1/encoder_level1.0/norm2/body/Sqrt_output_0 0=5
BinaryOp                 /encoder_level1/encoder_level1.0/norm2/body/Div 2 1 /encoder_level1/encoder_level1.0/norm2/body/Sub_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/norm2/body/Sqrt_output_0 /encoder_level1/encoder_level1.0/norm2/body/Div_output_0 0=3
BinaryOp                 /encoder_level1/encoder_level1.0/norm2/body/Mul_1 2 1 /encoder_level1/encoder_level1.0/norm2/body/Div_output_0 encoder_level1.0.norm2.body.weight /encoder_level1/encoder_level1.0/norm2/body/Mul_1_output_0 0=2
Reshape                  /encoder_level1/encoder_level1.0/norm2/Reshape_1 1 1 /encoder_level1/encoder_level1.0/norm2/body/Mul_1_output_0 /encoder_level1/encoder_level1.0/norm2/Reshape_1_output_0 0=48 1=512 2=512
Permute                  /encoder_level1/encoder_level1.0/norm2/Transpose_1 1 1 /encoder_level1/encoder_level1.0/norm2/Reshape_1_output_0 /encoder_level1/encoder_level1.0/norm2/Transpose_1_output_0 0=4
Convolution              /encoder_level1/encoder_level1.0/ffn/project_in/Conv 1 1 /encoder_level1/encoder_level1.0/norm2/Transpose_1_output_0 /encoder_level1/encoder_level1.0/ffn/project_in/Conv_output_0 0=254 1=1 5=1 6=12192
ConvolutionDepthWise     /encoder_level1/encoder_level1.0/ffn/dwconv/Conv 1 1 /encoder_level1/encoder_level1.0/ffn/project_in/Conv_output_0 /encoder_level1/encoder_level1.0/ffn/dwconv/Conv_output_0 0=254 1=3 4=1 5=1 6=2286 7=254
Split                    splitncnn_10             1 2 /encoder_level1/encoder_level1.0/ffn/dwconv/Conv_output_0 /encoder_level1/encoder_level1.0/ffn/dwconv/Conv_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/ffn/dwconv/Conv_output_0_splitncnn_1
Crop                     /encoder_level1/encoder_level1.0/ffn/Slice 1 1 /encoder_level1/encoder_level1.0/ffn/dwconv/Conv_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/ffn/Slice_output_0 -23309=1,0 -23310=1,127 -23311=1,0
Split                    splitncnn_11             1 2 /encoder_level1/encoder_level1.0/ffn/Slice_output_0 /encoder_level1/encoder_level1.0/ffn/Slice_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/ffn/Slice_output_0_splitncnn_1
Crop                     /encoder_level1/encoder_level1.0/ffn/Slice_1 1 1 /encoder_level1/encoder_level1.0/ffn/dwconv/Conv_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/ffn/Slice_1_output_0 -23309=1,127 -23310=1,254 -23311=1,0
BinaryOp                 /encoder_level1/encoder_level1.0/ffn/Div_1 1 1 /encoder_level1/encoder_level1.0/ffn/Slice_output_0_splitncnn_1 /encoder_level1/encoder_level1.0/ffn/Div_1_output_0 0=3 1=1 2=1.414214e+00
Erf                      /encoder_level1/encoder_level1.0/ffn/Erf 1 1 /encoder_level1/encoder_level1.0/ffn/Div_1_output_0 /encoder_level1/encoder_level1.0/ffn/Erf_output_0
BinaryOp                 /encoder_level1/encoder_level1.0/ffn/Add_1 1 1 /encoder_level1/encoder_level1.0/ffn/Erf_output_0 /encoder_level1/encoder_level1.0/ffn/Add_1_output_0 1=1 2=1.000000e+00
BinaryOp                 /encoder_level1/encoder_level1.0/ffn/Mul_2 2 1 /encoder_level1/encoder_level1.0/ffn/Slice_output_0_splitncnn_0 /encoder_level1/encoder_level1.0/ffn/Add_1_output_0 /encoder_level1/encoder_level1.0/ffn/Mul_2_output_0 0=2
BinaryOp                 /encoder_level1/encoder_level1.0/ffn/Mul_3 1 1 /encoder_level1/encoder_level1.0/ffn/Mul_2_output_0 /encoder_level1/encoder_level1.0/ffn/Mul_3_output_0 0=2 1=1 2=5.000000e-01
BinaryOp                 /encoder_level1/encoder_level1.0/ffn/Mul_4 2 1 /encoder_level1/encoder_level1.0/ffn/Mul_3_output_0 /encoder_level1/encoder_level1.0/ffn/Slice_1_output_0 /encoder_level1/encoder_level1.0/ffn/Mul_4_output_0 0=2
Convolution              /encoder_level1/encoder_level1.0/ffn/project_out/Conv 1 1 /encoder_level1/encoder_level1.0/ffn/Mul_4_output_0 /encoder_level1/encoder_level1.0/ffn/project_out/Conv_output_0 0=48 1=1 5=1 6=6096
