7767517
5 5
Input            input                    0 1 input 0=3 1=512 2=512
Convolution      enc1                     1 1 input enc_out 0=64 1=3 2=1 3=1 4=1 5=1 6=1728
Convolution      trans1                   1 1 enc_out trans_out 0=128 1=3 2=1 3=1 4=1 5=1 6=73728
Convolution      dec1                     1 1 trans_out dec_out 0=64 1=3 2=1 3=1 4=1 5=1 6=73728
Convolution      output_conv              1 1 dec_out output 0=3 1=3 2=1 3=1 4=1 5=1 6=1731
