7767517
3 3
Input            input                    0 1 input 0=3 1=512 2=512
Convolution      conv1                    1 1 input output 0=32 1=3 2=1 3=1 4=1 5=1 6=864
Convolution      conv2                    1 1 output output2 0=3 1=3 2=1 3=1 4=1 5=1 6=867
