7767517
69 96
Input            input                    0 1 input
Split            splitncnn_input0         1 4 input input_splitncnn_0 input_splitncnn_1 input_splitncnn_2 input_splitncnn_3
ConvolutionDepthWise /inner/e_conv1/depth_conv/Conv 1 1 input_splitncnn_3 /inner/e_conv1/depth_conv/Conv_output_0 0=3 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27 7=3
Convolution      /inner/e_conv1/point_conv/Conv 1 1 /inner/e_conv1/depth_conv/Conv_output_0 /inner/e_conv1/point_conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=96
ReLU             /inner/relu/Relu         1 1 /inner/e_conv1/point_conv/Conv_output_0 /inner/relu/Relu_output_0
Split            splitncnn_0              1 2 /inner/relu/Relu_output_0 /inner/relu/Relu_output_0_splitncnn_0 /inner/relu/Relu_output_0_splitncnn_1
ConvolutionDepthWise /inner/e_conv2/depth_conv/Conv 1 1 /inner/relu/Relu_output_0_splitncnn_1 /inner/e_conv2/depth_conv/Conv_output_0 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      /inner/e_conv2/point_conv/Conv 1 1 /inner/e_conv2/depth_conv/Conv_output_0 /inner/e_conv2/point_conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             /inner/relu_1/Relu       1 1 /inner/e_conv2/point_conv/Conv_output_0 /inner/relu_1/Relu_output_0
Split            splitncnn_1              1 2 /inner/relu_1/Relu_output_0 /inner/relu_1/Relu_output_0_splitncnn_0 /inner/relu_1/Relu_output_0_splitncnn_1
ConvolutionDepthWise /inner/e_conv3/depth_conv/Conv 1 1 /inner/relu_1/Relu_output_0_splitncnn_1 /inner/e_conv3/depth_conv/Conv_output_0 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      /inner/e_conv3/point_conv/Conv 1 1 /inner/e_conv3/depth_conv/Conv_output_0 /inner/e_conv3/point_conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             /inner/relu_2/Relu       1 1 /inner/e_conv3/point_conv/Conv_output_0 /inner/relu_2/Relu_output_0
Split            splitncnn_2              1 2 /inner/relu_2/Relu_output_0 /inner/relu_2/Relu_output_0_splitncnn_0 /inner/relu_2/Relu_output_0_splitncnn_1
ConvolutionDepthWise /inner/e_conv4/depth_conv/Conv 1 1 /inner/relu_2/Relu_output_0_splitncnn_1 /inner/e_conv4/depth_conv/Conv_output_0 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      /inner/e_conv4/point_conv/Conv 1 1 /inner/e_conv4/depth_conv/Conv_output_0 /inner/e_conv4/point_conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             /inner/relu_3/Relu       1 1 /inner/e_conv4/point_conv/Conv_output_0 /inner/relu_3/Relu_output_0
Concat           /inner/Concat            2 1 /inner/relu_2/Relu_output_0_splitncnn_0 /inner/relu_3/Relu_output_0 /inner/Concat_output_0 0=0
ConvolutionDepthWise /inner/e_conv5/depth_conv/Conv 1 1 /inner/Concat_output_0 /inner/e_conv5/depth_conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      /inner/e_conv5/point_conv/Conv 1 1 /inner/e_conv5/depth_conv/Conv_output_0 /inner/e_conv5/point_conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             /inner/relu_4/Relu       1 1 /inner/e_conv5/point_conv/Conv_output_0 /inner/relu_4/Relu_output_0
Concat           /inner/Concat_1          2 1 /inner/relu_1/Relu_output_0_splitncnn_0 /inner/relu_4/Relu_output_0 /inner/Concat_1_output_0 0=0
ConvolutionDepthWise /inner/e_conv6/depth_conv/Conv 1 1 /inner/Concat_1_output_0 /inner/e_conv6/depth_conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      /inner/e_conv6/point_conv/Conv 1 1 /inner/e_conv6/depth_conv/Conv_output_0 /inner/e_conv6/point_conv/Conv_output_0 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             /inner/relu_5/Relu       1 1 /inner/e_conv6/point_conv/Conv_output_0 /inner/relu_5/Relu_output_0
Concat           /inner/Concat_2          2 1 /inner/relu/Relu_output_0_splitncnn_0 /inner/relu_5/Relu_output_0 /inner/Concat_2_output_0 0=0
ConvolutionDepthWise /inner/e_conv7/depth_conv/Conv 1 1 /inner/Concat_2_output_0 /inner/e_conv7/depth_conv/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      /inner/e_conv7/point_conv/Conv 1 1 /inner/e_conv7/depth_conv/Conv_output_0 /inner/e_conv7/point_conv/Conv_output_0 0=3 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=192
UnaryOp          /inner/Tanh              1 1 /inner/e_conv7/point_conv/Conv_output_0 /inner/Tanh_output_0 0=16
Split            splitncnn_3              1 8 /inner/Tanh_output_0 /inner/Tanh_output_0_splitncnn_0 /inner/Tanh_output_0_splitncnn_1 /inner/Tanh_output_0_splitncnn_2 /inner/Tanh_output_0_splitncnn_3 /inner/Tanh_output_0_splitncnn_4 /inner/Tanh_output_0_splitncnn_5 /inner/Tanh_output_0_splitncnn_6 /inner/Tanh_output_0_splitncnn_7
BinaryOp         /inner/Pow               1 1 input_splitncnn_2 /inner/Pow_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub               2 1 /inner/Pow_output_0 input_splitncnn_1 /inner/Sub_output_0 0=1
BinaryOp         /inner/Mul               2 1 /inner/Tanh_output_0_splitncnn_7 /inner/Sub_output_0 /inner/Mul_output_0 0=2
BinaryOp         /inner/Add               2 1 input_splitncnn_0 /inner/Mul_output_0 /inner/Add_output_0 0=0
Split            splitncnn_4              1 3 /inner/Add_output_0 /inner/Add_output_0_splitncnn_0 /inner/Add_output_0_splitncnn_1 /inner/Add_output_0_splitncnn_2
BinaryOp         /inner/Pow_1             1 1 /inner/Add_output_0_splitncnn_2 /inner/Pow_1_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub_1             2 1 /inner/Pow_1_output_0 /inner/Add_output_0_splitncnn_1 /inner/Sub_1_output_0 0=1
BinaryOp         /inner/Mul_1             2 1 /inner/Tanh_output_0_splitncnn_6 /inner/Sub_1_output_0 /inner/Mul_1_output_0 0=2
BinaryOp         /inner/Add_1             2 1 /inner/Add_output_0_splitncnn_0 /inner/Mul_1_output_0 /inner/Add_1_output_0 0=0
Split            splitncnn_5              1 3 /inner/Add_1_output_0 /inner/Add_1_output_0_splitncnn_0 /inner/Add_1_output_0_splitncnn_1 /inner/Add_1_output_0_splitncnn_2
BinaryOp         /inner/Pow_2             1 1 /inner/Add_1_output_0_splitncnn_2 /inner/Pow_2_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub_2             2 1 /inner/Pow_2_output_0 /inner/Add_1_output_0_splitncnn_1 /inner/Sub_2_output_0 0=1
BinaryOp         /inner/Mul_2             2 1 /inner/Tanh_output_0_splitncnn_5 /inner/Sub_2_output_0 /inner/Mul_2_output_0 0=2
BinaryOp         /inner/Add_2             2 1 /inner/Add_1_output_0_splitncnn_0 /inner/Mul_2_output_0 /inner/Add_2_output_0 0=0
Split            splitncnn_6              1 3 /inner/Add_2_output_0 /inner/Add_2_output_0_splitncnn_0 /inner/Add_2_output_0_splitncnn_1 /inner/Add_2_output_0_splitncnn_2
BinaryOp         /inner/Pow_3             1 1 /inner/Add_2_output_0_splitncnn_2 /inner/Pow_3_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub_3             2 1 /inner/Pow_3_output_0 /inner/Add_2_output_0_splitncnn_1 /inner/Sub_3_output_0 0=1
BinaryOp         /inner/Mul_3             2 1 /inner/Tanh_output_0_splitncnn_4 /inner/Sub_3_output_0 /inner/Mul_3_output_0 0=2
BinaryOp         /inner/Add_3             2 1 /inner/Add_2_output_0_splitncnn_0 /inner/Mul_3_output_0 /inner/Add_3_output_0 0=0
Split            splitncnn_7              1 3 /inner/Add_3_output_0 /inner/Add_3_output_0_splitncnn_0 /inner/Add_3_output_0_splitncnn_1 /inner/Add_3_output_0_splitncnn_2
BinaryOp         /inner/Pow_4             1 1 /inner/Add_3_output_0_splitncnn_2 /inner/Pow_4_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub_4             2 1 /inner/Pow_4_output_0 /inner/Add_3_output_0_splitncnn_1 /inner/Sub_4_output_0 0=1
BinaryOp         /inner/Mul_4             2 1 /inner/Tanh_output_0_splitncnn_3 /inner/Sub_4_output_0 /inner/Mul_4_output_0 0=2
BinaryOp         /inner/Add_4             2 1 /inner/Add_3_output_0_splitncnn_0 /inner/Mul_4_output_0 /inner/Add_4_output_0 0=0
Split            splitncnn_8              1 3 /inner/Add_4_output_0 /inner/Add_4_output_0_splitncnn_0 /inner/Add_4_output_0_splitncnn_1 /inner/Add_4_output_0_splitncnn_2
BinaryOp         /inner/Pow_5             1 1 /inner/Add_4_output_0_splitncnn_2 /inner/Pow_5_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub_5             2 1 /inner/Pow_5_output_0 /inner/Add_4_output_0_splitncnn_1 /inner/Sub_5_output_0 0=1
BinaryOp         /inner/Mul_5             2 1 /inner/Tanh_output_0_splitncnn_2 /inner/Sub_5_output_0 /inner/Mul_5_output_0 0=2
BinaryOp         /inner/Add_5             2 1 /inner/Add_4_output_0_splitncnn_0 /inner/Mul_5_output_0 /inner/Add_5_output_0 0=0
Split            splitncnn_9              1 3 /inner/Add_5_output_0 /inner/Add_5_output_0_splitncnn_0 /inner/Add_5_output_0_splitncnn_1 /inner/Add_5_output_0_splitncnn_2
BinaryOp         /inner/Pow_6             1 1 /inner/Add_5_output_0_splitncnn_2 /inner/Pow_6_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub_6             2 1 /inner/Pow_6_output_0 /inner/Add_5_output_0_splitncnn_1 /inner/Sub_6_output_0 0=1
BinaryOp         /inner/Mul_6             2 1 /inner/Tanh_output_0_splitncnn_1 /inner/Sub_6_output_0 /inner/Mul_6_output_0 0=2
BinaryOp         /inner/Add_6             2 1 /inner/Add_5_output_0_splitncnn_0 /inner/Mul_6_output_0 /inner/Add_6_output_0 0=0
Split            splitncnn_10             1 3 /inner/Add_6_output_0 /inner/Add_6_output_0_splitncnn_0 /inner/Add_6_output_0_splitncnn_1 /inner/Add_6_output_0_splitncnn_2
BinaryOp         /inner/Pow_7             1 1 /inner/Add_6_output_0_splitncnn_2 /inner/Pow_7_output_0 0=6 1=1 2=2.000000e+00
BinaryOp         /inner/Sub_7             2 1 /inner/Pow_7_output_0 /inner/Add_6_output_0_splitncnn_1 /inner/Sub_7_output_0 0=1
BinaryOp         /inner/Mul_7             2 1 /inner/Tanh_output_0_splitncnn_0 /inner/Sub_7_output_0 /inner/Mul_7_output_0 0=2
BinaryOp         /inner/Add_7             2 1 /inner/Add_6_output_0_splitncnn_0 /inner/Mul_7_output_0 output 0=0
